Revit 2024 API
FabricationPart.CanASlopeBeApplied Method
 This will test if a slope can be applied to the part and maintain connections with any connected parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool CanASlopeBeApplied()
Visual Basic
Public Function CanASlopeBeApplied As Boolean
Visual C++
public:
bool CanASlopeBeApplied()
Return Value
 Returns true if the part can be successfully sloped otherwise false.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace